# Â© 2022 by <b> Aspire Academy </b>, All Rights Reserved.

# DATA HANDLING USING PANDAS PART - 01

![PART1](assets/PART1.png)

# DATAFRAMES

One limitation of series is that it is not able to handle the data in the form of 2D or multidimensional related to real time.

For such tasks, Python Pandas provides another data structure called dataframe.

**Points**:

1. Dataframe objects of Pandas can store 2D heterogeneous data.
2. It is a two-dimensional data structure, just like any table (with rows and columns)
3. Size of the dataframe is mutable
4. Data/values are also mutable and can be changed any time.

### Dataframes can be created with the following constructs:

+ Lists
+ Series
+ Dictionary
+ NumPy ndaarays

In [1]:
#to create a dataframe from list
import pandas as pd

list1 = [10,20,30,40,50]
df1 = pd.DataFrame(list1)
print(df1)

    0
0  10
1  20
2  30
3  40
4  50

In [7]:
#create a dataframe from nested lists

data1 = [['Tanmoy', 18],['Fiza', 17], ['Pritvi', 19]]
df1 = pd.DataFrame(data1, columns = ['Name', 'Age'])
print(df1)

     Name  Age
0  Tanmoy   18
1    Fiza   17
2  Pritvi   19

In [9]:
# dataframe from two series of student data

student_marks = pd.Series({'Vijaya':80, 'Rahul':92, 'Megha':67,
                          'Radhika':95, 'Shaurya':97})

student_age = pd.Series({'Vijaya':32, 'Rahul': 28, 'Megha':30,
                        'Radhika':25, 'Shaurya':20})

student_df = pd.DataFrame({'Marks': student_marks, 'Age': student_age})

print(student_df)

         Marks  Age
Vijaya      80   32
Rahul       92   28
Megha       67   30
Radhika     95   25
Shaurya     97   20

In [10]:
#sort values in a dataframe

print(student_df.sort_values(by=['Marks']))

         Marks  Age
Megha       67   30
Vijaya      80   32
Rahul       92   28
Radhika     95   25
Shaurya     97   20

In [12]:
#sort values in a dataframe

print(student_df.sort_values(by=['Age'], ascending = False))

         Marks  Age
Vijaya      80   32
Megha       67   30
Rahul       92   28
Radhika     95   25
Shaurya     97   20

### Creating DataFrame From Dictionary

The different ways to create a dataframe using dictionary are:-

1. Dictionary of List
2. Dictionary of Series
3. List of Dictionaries

```
The dictionary keys by default are taken as column names
```

In [17]:
## creating a df using dictionary of list
student = {'Name': ['Rinku','Ritu', 'Ajay','Pankaj','Aditya'],
          'English':[67,78,75,88,92],
          'Economics':[78,56,89,90,89],
          'IP':[91,99,90,89,90],
          'Accounts':[77,87,46,55,90]}

df = pd.DataFrame(student)
print(df)

     Name  English  Economics  IP  Accounts
0   Rinku       67         78  91        77
1    Ritu       78         56  99        87
2    Ajay       75         89  90        46
3  Pankaj       88         90  89        55
4  Aditya       92         89  90        90

In [18]:
## creating a df from dictionary of series

n = pd.Series(['Rinku','Ritu', 'Ajay','Pankaj','Aditya'])
Eng = pd.Series([67,78,75,88,92])
Eco = pd.Series([78,56,89,90,89])
IP = pd.Series([91,99,90,89,90])

std_result = {'Name': n, 'English': Eng, 'Economics':Eco, 
              'Information Practices':IP}
df = pd.DataFrame(std_result)
print(df)

     Name  English  Economics  Information Practices
0   Rinku       67         78                     91
1    Ritu       78         56                     99
2    Ajay       75         89                     90
3  Pankaj       88         90                     89
4  Aditya       92         89                     90

In [19]:
# by directly passing
std_result = {'Name': pd.Series(['Rinku','Ritu', 'Ajay','Pankaj','Aditya']),
              'English': pd.Series([67,78,75,88,92]), 
              'Economics':pd.Series([78,56,89,90,89]), 
              'Information Practices':pd.Series([91,99,90,89,90])
             }
df = pd.DataFrame(std_result)
print(df)

     Name  English  Economics  Information Practices
0   Rinku       67         78                     91
1    Ritu       78         56                     99
2    Ajay       75         89                     90
3  Pankaj       88         90                     89
4  Aditya       92         89                     90

In [35]:
# create a df by passing a list of dictionaries
newstudent = [{'Vijaya':80,'Rahul':92, 'Megha':67,'Radhika':95, 'Shaurya':97},
             {'Vijaya':85,'Rahul':92,'Radhika':75, 'Shaurya':77},
             {'Vijaya':80,'Megha':87,'Radhika':65, 'Shaurya':56}]

df = pd.DataFrame(newstudent,index = ['Sno1','Sno2','Sno3'])
print(df)

      Vijaya  Rahul  Megha  Radhika  Shaurya
Sno1      80   92.0   67.0       95       97
Sno2      85   92.0    NaN       75       77
Sno3      80    NaN   87.0       65       56

In [27]:
# creating a dataframe from numpy ndarray
import numpy as np
import pandas as pd

array = np.array([[67,48,89,92], [94,67,65,98],
                 [78,98,56,78], [44,56,78,98]])

column_names = ['English', 'Mathematics', 'IP', 'Accounts']

df = pd.DataFrame(data = array, columns = column_names)
print(df)

   English  Mathematics  IP  Accounts
0       67           48  89        92
1       94           67  65        98
2       78           98  56        78
3       44           56  78        98

#### SELECTING AND ACCESSING, MODIFYING RECORDS FROM DATAFRAME

In [46]:
std_result = {'Name':['Rinku','Ritu', 'Ajay','Pankaj','Aditya'],
              'English':[67,78,75,88,92], 
              'Economics':[78,56,89,90,89], 
              'Information Practices':[91,99,90,89,90]
             }
df = pd.DataFrame(std_result, index = ['Sno1','Sno2', 'Sno3', 'Sno4', 'Sno5'])
df

        Name  English  Economics  Information Practices
Sno1   Rinku       67         78                     91
Sno2    Ritu       78         56                     99
Sno3    Ajay       75         89                     90
Sno4  Pankaj       88         90                     89
Sno5  Aditya       92         89                     90

In [38]:
df[1:4]

     Name  English  Economics  Information Practices
1    Ritu       78         56                     99
2    Ajay       75         89                     90
3  Pankaj       88         90                     89

In [47]:
df.set_index('Name',inplace = True)
df

        English  Economics  Information Practices
Name
Rinku        67         78                     91
Ritu         78         56                     99
Ajay         75         89                     90
Pankaj       88         90                     89
Aditya       92         89                     90

In [49]:
df.reset_index(inplace = True)
df

     Name  English  Economics  Information Practices
0   Rinku       67         78                     91
1    Ritu       78         56                     99
2    Ajay       75         89                     90
3  Pankaj       88         90                     89
4  Aditya       92         89                     90

### Adding/Modifying a Row in a DataFrame

**df.loc[]** method used.

In [51]:
# create a df
newstudent = [{'Vijaya':80,'Rahul':92, 'Megha':67,'Radhika':95, 'Shaurya':97},
             {'Vijaya':85,'Rahul':92,'Radhika':75, 'Shaurya':77},
             {'Vijaya':80,'Megha':87,'Radhika':65, 'Shaurya':56}]

df = pd.DataFrame(newstudent)
df

   Vijaya  Rahul  Megha  Radhika  Shaurya
0      80   92.0   67.0       95       97
1      85   92.0    NaN       75       77
2      80    NaN   87.0       65       56

In [52]:
df.loc['3'] = ['70','67','93','56','89'] #new record added at location 3
df

  Vijaya Rahul Megha Radhika Shaurya
0     80  92.0  67.0      95      97
1     85  92.0   NaN      75      77
2     80   NaN  87.0      65      56
3     70    67    93      56      89

### Renaming a Column Name in a DataFrame

In [53]:
a1 = [101,102,103,104,105]
df = pd.DataFrame(a1)
a1

[101, 102, 103, 104, 105]

In [54]:
df

     0
0  101
1  102
2  103
3  104
4  105

In [56]:
df.columns = ['AdmNo']
df

   AdmNo
0    101
1    102
2    103
3    104
4    105

In [58]:
df.rename(columns = {'AdmNo': 'Admission No'}, inplace = True)
df

   Admission No
0           101
1           102
2           103
3           104
4           105

### Adding Columns to a DataFrame